
/*довжина рядка */

const text = 'якийсь текст, довжину якого треба дізнатися';
console.log (text);
const leng = text.length; 
console.log (leng); 

/* його можна і не виводити в консоль і не вводити , як окрему змінну */
console.log ('якийсь текст, який я навіть не вписала і не вивела в консоль'.length); 


/*перетворення у рядок */
/*явне перетворення до рядка 
все що вводиться, воно просто огортається в лапки і виходить вже , як текст*/
console.log (String(10)); //10
console.log (String(true));//true

/*НЕ явне перетворення до рядка 
якщо додавати щось до рядка, то те що додається - стане рядком */
console.log ('5'+3); //53
console.log (10+'10'); //1010
console.log ('60'+true);//60true


/*============================================= */

/*перетворення у число */
/*явне перетворення до рядка 
все що вводиться, воно просто огортається в лапки і виходить вже , як текст*/
console.log (Number('100')); //число 100
console.log (Number(true));//число 1
console.log (Number(false));//число 0
console.log (Number(null));//число 0
console.log (Number('хоча б одна буква'));// NaN

/*або можна використати унарний + чи будьякий інший символ. Він буде означати те саме , що записати  Number */
console.log (+('156'));//число 156


/*НЕ явне перетворення до числа 
якщо ми робимо над числом і ще чимось якусь арефметичну операцію */
console.log ('5'*3); //5*3=15 число
console.log (267-'11'); //256 число
console.log (60+true);//60це число + тру (яке призводиться до 1) = 61 число