/* Результат завжи ТРУ або ФОЛС

НЕ СУВОРІ 
== ТРУ(якщо значення операторів рівні)
!= ТРУ ( якщо значення операторів НЕ рівні)
роблять неявні перетворення! Намагаються призвести до числа все, що їм дають 
*/

//console.log (5==6); // значення не рівні, тому ФОЛС
//console.log (5=='6'); // не явно переведе 6 у цифру і значення будуть 5==6 ФОЛС, бо не рівні

//console.log (5!=6); // ТРУ бо значення НЕ рівні
//console.log (5!='6'); //ТРУ , бо переведе в цифру і значення будуть НЕ рівні



/*СУВОРІ
=== ТРУ (  якщо значення рівні та мають однаковий тип данних)
!=== ТРУ (якщо НЕ рівні або різний тип данних)
*/

//console.log (5===6); // значення не рівні, тому ФОЛС
//console.log (5==='6'); // ФОЛС бо мають різний вид данних

//console.log (5!==6); // ТРУ бо значення НЕ рівні
//console.log (5!=='6'); //ТРУ , бо мають різний тип данних



/*якщо порівнюються рядок + рядок, то вони порівнюються по ЮНІКОДУ 
А-1
Б-2
...
а-34
б-35
..
1-1
2-2

спочатку перший символ першого числа порівняється з першим символом другого числа і так по черзі 

*/
console.log ('5'!=='6'); //ТРУ , бо 5 має юнікод  (U+0035), а 6 має юнікод (U+0036)


console.log (Number('0'));
console.log (Number('f'));
console.log (Number('5f'));

const fac = Number.parseFloat (prompt ('fac fac fac'));//виведе вікно для введення числа, введене число буде видаватися , як число

const mac = '50px';//50px текст

const numberMac = Number.parseFloat (mac);//виведе число , яке є частинкою mac

console.log (numberMac); 

const numberMacfac = Number.parseFloat ('150hp'); //зробить те саме, виведе число , яке є частинкою дужок . Тобто - кородша формула
console.log (numberMacfac);


let matem  = 1529.7 //щоб перезаписати цю змінну повинно бути ЛЕТ
console.log (matem);
matem  = Math.floor (matem);// треба перезаписати змінну звертаючись до математичних функцій
console.log (matem);