
/*const a =20;
const b =100;

for ( let i =a ;
    i <=b;
    i++ )

  {  
    if (i % 5 ===0 ) {console.log(i);}    

  }
    */

  /* const min =0;
  const max = 5;
 let total =0;

  for (let number = min; 
    number <=max;
    number++)
  if (number %2 ===0) {console.log (number + total);}*/



 /* Напиши програму, яка спочатку виводить число 1, потім інкрементує його на 1 і виводить це число, потім декрементує його на 1 і знову виводить.

 let a=1; 
if (a=1) {console.log(a);}
if (a=1) {console.log(++a);}
if (a=1) {console.log(--a);}

*/


/*4. Задача на логічні оператори (AND, OR)
Напиши функцію, яка приймає три числа і перевіряє, чи є хоча б одне з них парним і більше за 10.*/
function name(a, b, c) {

return (a%2===0 && a>10) ? 'число А парне і більше за 10' : (b%2===0 && b>10) ? 'число В парне і більше за 10' :(c%2===0 && c>10) ? 'число С парне і більше за 10': 'число не парне або менше за 10';

}

console.log(name (2,7,20));
