/* арифметика + - (/ - ділення) (% - залишок від ділення) (** - namA** вводиться у ступінь namB тобто 3помножується на себе 4 рази) */

const namA = 3;
const namB = 4;
const result =namA**namB;
console.log (result);

/*конкатинація рядків */

const name = 'Lola';
const soName = 'Palola';

const fulName = 'твоє прізвисько' + ' ' + name + ' ' + soName + '.';
console.log (fulName);

/*шаблонні рядки 

!!!!!
У НАХИЛЕНИХ ЛАПКАХ 
!!!!! 

!!!!!
в лапки можна вставити формулу 
!!!!!!
*/

const name2 = 'Lola';
const soName2 = 'Palola';

const fulName2 = `твоє прізвисько ${name2} ${soName2}.`;
console.log (fulName2);


const name3 = 'Lola';
const soName3 = 'Palola';

const fulName3 = `твоє прізвисько ${name3+soName3 + 120+5} СМ.`;
console.log (fulName3);


/*перетворення у рядок */
/*явне перетворення до рядка 
все що вводиться, воно просто огортається в лапки і виходить вже , як текст*/
console.log (String(10)); //10
console.log (String(true));//true

/*НЕ явне перетворення до рядка 
якщо додавати щось до рядка, то те що додається - стане рядком */
console.log ('5'+3); //53
console.log (10+'10'); //1010
console.log ('60'+true);//60true


/*============================================= */

/*перетворення у число */
/*явне перетворення до рядка 
все що вводиться, воно просто огортається в лапки і виходить вже , як текст*/
console.log (Number('100')); //число 100
console.log (Number(true));//число 1
console.log (Number(false));//число 0
console.log (Number(null));//число 0
console.log (Number('хоча б одна буква'));// NaN

/*або можна використати унарний + чи будьякий інший символ. Він буде означати те саме , що записати  Number */
console.log (+('156'));//число 156


/*НЕ явне перетворення до числа 
якщо ми робимо над числом і ще чимось якусь арефметичну операцію */
console.log ('5'*3); //5*3=15 число
console.log (267-'11'); //256 число
console.log (60+true);//60це число + тру (яке призводиться до 1) = 61 число





/* Результат завжи ТРУ або ФОЛС

НЕ СУВОРІ 
== ТРУ(якщо значення операторів рівні)
!= ТРУ ( якщо значення операторів НЕ рівні)
роблять неявні перетворення! Намагаються призвести до числа все, що їм дають 
*/

//console.log (5==6); // значення не рівні, тому ФОЛС
//console.log (5=='6'); // не явно переведе 6 у цифру і значення будуть 5==6 ФОЛС, бо не рівні

//console.log (5!=6); // ТРУ бо значення НЕ рівні
//console.log (5!='6'); //ТРУ , бо переведе в цифру і значення будуть НЕ рівні



/*СУВОРІ
=== ТРУ (  якщо значення рівні та мають однаковий тип данних)
!=== ТРУ (якщо НЕ рівні або різний тип данних)
*/

//console.log (5===6); // значення не рівні, тому ФОЛС
//console.log (5==='6'); // ФОЛС бо мають різний вид данних

//console.log (5!==6); // ТРУ бо значення НЕ рівні
//console.log (5!=='6'); //ТРУ , бо мають різний тип данних



/*якщо порівнюються рядок + рядок, то вони порівнюються по ЮНІКОДУ 
А-1
Б-2
...
а-34
б-35
..
1-1
2-2

спочатку перший символ першого числа порівняється з першим символом другого числа і так по черзі 

*/
console.log ('5'!=='6'); //ТРУ , бо 5 має юнікод  (U+0035), а 6 має юнікод (U+0036)


console.log (Number('0'));
console.log (Number('f'));
console.log (Number('5f'));

const fac = Number.parseFloat (prompt ('fac fac fac'));//виведе вікно для введення числа, введене число буде видаватися , як число

const mac = '50px';//50px текст

const numberMac = Number.parseFloat (mac);//виведе число , яке є частинкою mac

console.log (numberMac); 

const numberMacfac = Number.parseFloat ('150hp'); //зробить те саме, виведе число , яке є частинкою дужок . Тобто - кородша формула
console.log (numberMacfac);


let matem  = 1529.7 //щоб перезаписати цю змінну повинно бути ЛЕТ
console.log (matem);
matem  = Math.floor (matem);// треба перезаписати змінну звертаючись до математичних функцій
console.log (matem);